emacs-document.org
#+TITLE: Emacs学习笔记
#+LANGUAGE:  zh
#+AUTHOR: Lu Jianmei
#+EMAIL: lu.jianmei@trs.com.cn
#+OPTIONS:   H:3 num:t   toc:3 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t p:t pri:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   author:t creator:t timestamp:t email:t
#+DESCRIPTION: A notes that include all works and study things in 2015
#+KEYWORDS:  org-mode Emacs jquery jquery.mobile jquery.ui wcm
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \setCJKmainfont{SimSun}
#+LATEX_CLASS: cn-article
#+STARTUP: logredeadline, logreschedule
#+ATTR_HTML: :border 2 :rules all :frame all


- [[file:../work-note-in-2015.org][{Back to Index}]]

* Emacs功能导览
* 功能模块
** Checking for manual
   通过emacs可以查看elisp的接口文档，从中间找到各个功能模块的变量定义等；
   操作办法： *M-: (info "(elisp) Memory Usage")*
** Org Mode
*** Property
    属性可以用于显示在column视图中，或者agenda view中，增加对任务的描述，描述可以是状态、属性补充等目标；它具有属性的继承性，因此在项目根结点上配置属性后，即可以在子任务中使用这些属性的备选值，使用快捷键进行切换；
    + 配置根属性的备选值
      在项目根节点上，配置如下属性，即可以通过 *C-c C-x p* 命令添加一条属性，并将光标定位在属性上后，通过 *S-left/right* 切换所需的属性值；
*** Column view
    Column view是建立于org-mode任务管理之上的快速以表格查看各个任务情况的视图，可以使用 *C-c C-x C-c* 来打开column view，而此种查看方式只是一种查看，并不会被打印，如果需要通过动态管理column view，并支持打印，可以通过 *C-c C-x i* 插入一个动态的column部分在文件中，但此部分不是动态关联的，即修改了任务内容，插入的column view是不会更新的，但可以通过执行 *C-c C-x C-u* 进行更新；注：已经通过配置(add-hook 'before-save-hook 'org-update-all-dblocks)达到在保存文件时，即会更新文件中所有的column view中的数据；
    当需要针对某一个特定的任务组生成一个column view时，可以在此任务组的任务上，执行 *C-c C-x p* 插入属性，选择id，输入一个id值，然后在插入动态column时，选择刚刚输入的id值即可；如果需要对这个表特殊定义不同的column结构，可以再执行 *C-c C-x p* 时选择 *COLUMN* 来重新定义一个新的column结构内容；保存即可自动更新表s格；
*** Capture
    Capture用于快速记录任务或者idea内容，并支持在后面进行capture的内容refile；
*** Agenda View
**** Agenda基本命令使用
    1. Agenda View用于以汇总视图的模式，组织单个或个多个文件中的任务，并可以按要求进行组织及排序，显示出当前各个项目的情况详情；Agenda view有如下几种视图
    + 按日历格式显示任务，可以指定日期、日期范围、按日、周、月、年来进行显示任务清单
      此模式目的是以当前日或者周来查看需要完成的工作清单；
    + 显示所有未完成的列表
      显示所有文件或项目中标记为TODO的任务列表，没有时间
    + 匹配按表头、标签、TODO状态等来显示任务清单
    + 按timeline模式显示，按时间排序
    + 搜索模式，按检索词的检索结果来组织显示数据
    + 问题项目或问题任务模式，显示各个项目中出问题或暂停的项目
    + 按自定义视图显示内容

    2. 在Agenda View模式中，查看或修改文件：
    当需要显示详细工作清单时，可以选择要查看的任务条目，点击 *TAB* 键，打开当前任务所在文件；如果需要修改，则在原文件中进行修改，修改完成后保存；切换到Agenda View中，按 *r* 键，则可以刷新修改后的内容；
    在Agenda View中需要使用快捷键操作，具体可以参考： http://orgmode.org/org.html#Agenda-commands， 快捷键可以支持直接通过此视图修改原org文件中的状态；

    3. 通过关键词搜索的方式显示
       可以采用搜索关键词的方式显示，搜索关键词可以为： ‘+computer +wifi -ethernet‘，即包含computer, wifi，不包含ethernet的任务清单；
    4. 显示Stuck项目
**** 对Agenda View进行修改
      1. 新增新的命令
         定义新的命令，来存储一些常用的搜索条件，定义需要显示的数据；此种方法可以按下面的代码形式，对Agenda Dispather进行定制：
#+BEGIN_SRC SH
(setq org-agenda-custom-commands
           '(("x" agenda)
             ("y" agenda*)
             ("w" todo "WAITING")
             ("W" todo-tree "WAITING")
             ("u" tags "+boss-urgent")
             ("v" tags-todo "+boss-urgent")
             ("U" tags-tree "+boss-urgent")
             ("f" occur-tree "\\<FIXME\\>")
             ("h" . "HOME+Name tags searches") ; description for "h" prefix
             ("hl" tags "+home+Lisa")
             ("hp" tags "+home+Peter")
             ("hk" tags "+home+Kim")))
#+END_SRC
      如上面定义了一些新的命令，即可以通过 *C-c a x* 打开agenda，通过 *C-c a w* 打开只包含 "WAITING"的状态的任务清单；
      2. 对现有命令的显示模式进行修改，采用block view的方式显示，即在一个buffer中，显示多个block，一次性查看不同的内容要求；
#+BEGIN_SRC SH
(setq org-agenda-custom-commands
           '(("h" "Agenda and Home-related tasks"
              ((agenda "")
               (tags-todo "home")
               (tags "garden")))
             ("o" "Agenda and Office-related tasks"
              ((agenda "")
               (tags-todo "work")
               (tags "office")))))
#+END_SRC
      如上面定义，则在一个view buffer中，定义了不同的block，显示不同的内容， 如 *C-c a h* 则会显示三块内容，第一块显示agenda, 第二块显示包含"home"的todo标签的任务，第三个则是包含"garden"标签的任务；
      3. org-mode包含一些可定义的命令，可以用于支持对自定义的命令进行特殊的定制，这些定义默认是通过全局有效使用，如果需要对个别命令，采用不同的配置要求，则可以针对不同的命令进行设备；
#+BEGIN_SRC SH
(setq org-agenda-custom-commands
           '(("w" todo "WAITING"
              ((org-agenda-sorting-strategy '(priority-down))
               (org-agenda-prefix-format "  Mixed: ")))
             ("U" tags-tree "+boss-urgent"
              ((org-show-context-detail 'minimal)))
             ("N" search ""
              ((org-agenda-files '("~org/notes.org"))
               (org-agenda-text-search-extra-files nil)))))
#+END_SRC
      如上面的定义，当执行 *C-c a w* 时显示只包含 "WAITING" 标签的任务，而再通过 *(org-agenda-sorting-strategy '(priority-down)* 来配置此view的排序条件为按优先级进行倒序排序；并增加 *Mixed:* 的前置；
      另外，配置个性修改参数，可以为单命令级别进行配置，也可以为个别block进行单独配置命令，如：
#+BEGIN_SRC SH
 (setq org-agenda-custom-commands
           '(("h" "Agenda and Home-related tasks"
              ((agenda)
               (tags-todo "home")
               (tags "garden"
                     ((org-agenda-sorting-strategy '(priority-up)))))
              ((org-agenda-sorting-strategy '(priority-down))))
             ("o" "Agenda and Office-related tasks"
              ((agenda)
               (tags-todo "work")
               (tags "office")))))
#+END_SRC
      如上面命令，则是对 *C-c a h* 命令进行配置了整体 *((org-agenda-sorting-strategy '(priority-down)))*, 然而又单独对显示中的 *home* block进行配置 *((org-agenda-sorting-strategy '(priority-up)))* 的排序策略；
      需要注意的是，参数中的值，可以是lisp语句，如果只是一个字符串，需要添加双引号；

      4. 如果想要只针对某一种文本内容进行配置，则可以采用 *org-agenda-custom-commands-contexts* 进行配置，如：
#+BEGIN_SRC SH
(setq org-agenda-custom-commands-contexts
           '(("o" (in-mode . "message-mode"))))
#+END_SRC
      如上面命令，则只针对 *message-mode* 有效；
      还可以将某一命令中，引用其它命令进行操作，如：
#+BEGIN_SRC SH
(setq org-agenda-custom-commands-contexts
           '(("o" "r" (in-mode . "message-mode"))))
#+END_SRC
**** Agenda View 导出
     Agenda view可以导出为text, html, pdf, postscript, icalendar格式；
** Tools in Emacs
  * Ielm Elisp编译器，M-x ielm
  * 使配置生效，M-x eval-buffer
  * 宏
  *
** Emacs Wanderlust
*** Wanderlust Install
    在Archlinux上有包的管理：因此直接通过sudo命令即可以直接安装；
    #+BEGIN_SRC sh
      sudo pacman -S wanderlust
    #+END_SRC
    安装完成后，它可能会在/usr/share/emacs/site-lisp/wl下生成对应的el配置文件；
    可以将配置文件拷到对应~/.emacs.d/site-list/wl下；
    接着需要安装它的相应的依赖包：elmo, bbdb, semi, w3m, 如果使用ssl协议还需要下载ssl.el文件；
    这些包可以在一些相应的网站可以下载：如http://www.emacswiki.org/上下载；

