emacs-document.org
*** Wanderlust Configuration
    下载我的配置文件到你的文件夹中：https://github.com/lujianmei/.emacs.d；
    找到~/.emacs.d/user/kevin/init-wl.el~文件下载；
    + 配置用户名，目录等相关信息
      + 按文件中的目录信息配置相关的存储目录，默认为~/mails，如果不需要修改则可以不用修改；
    + 配置imap目录，与邮箱web端的目录结构相同
      + 参照~/.emacs.d/user/kevin/folders文件，配置与生产环境相同的目录结构；
      + 可以直接通过邮箱服务端配置好邮件的过滤功能，然后直接在wl中进行下载查看；
    + 配置登录密码，邮件发送密码
      + init-wl.el文件中已经默认配置好了passwd的文件目录，用于存储imap, stmp的加密后的密码信息的；
      + 因此可以将folders文件按要求放到对应的目录下，然后在登录邮箱，并成功发送邮件后，执行：M-x elmo-passwd-alist-save方法，它即会自动将密码信息写入此文件中；
      + 下次即不再要求通过密码校验了；
    + 配置签名文件
      + 可以在init-wl.el文件中找到对应的signature文件的目录，因此在对应的地方新建一个文件，然后将签名内容拷进去；
      + 则可以在发送邮件时自动生成对应的签名在后面；
    + 配置邮件附件打开方式
      + 参照~/.emacs.d/user/kevin/mailcap文件，配置当前操作系统下的用来查看附件文件的方式；
      + 如下例子：
        #+BEGIN_SRC sh
           application/pdf; okular  %s
           application/msword; catdoc %s
           application/octet-stream; et  %s
           application/octet-stream; wpp  %s
           application/octet-stream; wps  %s
           application/*; xdg-open  %s
           image/*; ristretto %s
           text/html; chromium %s
           text/*; emacsclient -c %s
           video/*; xdg-open %s
           audio/*; xdg-open %s
           application/x-rar; xarchiver %s
           application/x-zip; xarchiver %s
           application/x-tar; xarchiver %s
        #+END_SRC
** Eshell

***

** Tramp
** Auctex

**
** Latex
** Plantuml
   http://www.plantuml.com/
   * 安装依赖
     在archlinux的aur中找到plantuml进行安装；
   * 使用，在需要生成的图的位置代码用如何代码框起来
#+BEGIN_SRC LISP
   ,#+begin_src plantuml :file some_filename.png :cmdline -r -s 0.8
  <context of ditaa source goes here>
   ,#+end_src
#+END_SRC
** Graphviz
   [[http://www.graphviz.org/]]
   * 安装依赖
#+BEGIN_SRC SH
    sudo pacman -S graphviz
#+END_SRC
   * 使用，在需要生成的图的位置代码用如何代码框起来
#+BEGIN_SRC LISP
     ,#+begin_src dot :file some_filename.png :cmdline -Kdot -Tpng
        <context of graphviz source goes here>
     ,#+end_src
#+END_SRC
** Diaat
   * 安装依赖
#+BEGIN_SRC SH
    sudo pacman -S ditaa
#+END_SRC
   * 使用，在需要生成的图的位置代码用如何代码框起来
#+BEGIN_SRC LISP
   ,#+begin_src ditaa :file some_filename.png :cmdline -r -s 0.8
  <context of ditaa source goes here>
   ,#+end_src
#+END_SRC
** TernJs
*** 功能说明
    Tern是一个按javascript语法标准实现的一个语法分析器，并可以结合auto-complete或者company插件，支持在js-mode中，使用代码补全功能；
*** 安装
    Tern需要通过npm进行安装，安装完成后它包含一个可执行的tern-server端，和需要与emacs整合的tern.el文件，以支持在emacs中自动启动和使用tern提供的服务；
#+begin_src sh
    npm install tern acorn glob minimatch
#+end_src
    以上安装，其实是安装tern的相应的依赖包，而最终启动还需要使用另一个下载的版本，为方便tern.el方便被引用，因此这里将tern直接下载在 *.emacs.d/site-lisp/* 目录下：
#+begin_src sh
    git clone git@github.com:ternjs/tern.git
#+end_src
    这时，在init.el文件中，可以加入如下代码：
#+begin_src lisp
;;----------------------------------------------------------------------------
;; load tern
;;----------------------------------------------------------------------------
;; load tern, a tools for javascript, need to download tern manually from: https://github.com/ternjs/tern
(add-to-list 'load-path "~/.emacs.d/site-lisp/tern/emacs/")
(autoload 'tern-mode "tern.el" nil t)

;; auto load tern-mode on js-mode
(add-hook 'js-mode-hook (lambda () (tern-mode t)))

(require-package 'tern-auto-complete)
#+end_src
     以上的配置，在重启后，会自动下载 *tern-auto-complete* 包，以支持配合 *auto-complete* 包进行代码自动提示，如果你使用的不是 *auto-complete* , 而使用的是 *company* 插件，则可以将 *(require-package 'tern-auto-complete)* 换为 *(require-package 'company-tern)*;

*** 使用
    参照： http://ternjs.net

** Sunrise Commander
   * 说明
     Sunrise是一款类似于dired的命令行的文件管理器，具有大量命令行操作工具；
   * 使用方法：显示当前及其子文件夹下所有文件
     press C-c C-f and type:  -not -type d

** GNUS with Offlineimap and  and msmtp
*** Offlineimap
**** 安装
#+begin_src sh
sudo pacman -Ss offlineimap
#+end_src
