emacs-document.md

### Wanderlust Configuration<a id="sec-2-4-2" name="sec-2-4-2"></a>

下载我的配置文件到你的文件夹中：<https://github.com/lujianmei/.emacs.d>；
找到~/.emacs.d/user/kevin/init-wl.el~文件下载；
-   配置用户名，目录等相关信息
    -   按文件中的目录信息配置相关的存储目录，默认为~/mails，如果不需要修改则可以不用修改；
-   配置imap目录，与邮箱web端的目录结构相同
    -   参照~/.emacs.d/user/kevin/folders文件，配置与生产环境相同的目录结构；
    -   可以直接通过邮箱服务端配置好邮件的过滤功能，然后直接在wl中进行下载查看；
-   配置登录密码，邮件发送密码
    -   init-wl.el文件中已经默认配置好了passwd的文件目录，用于存储imap, stmp的加密后的密码信息的；
    -   因此可以将folders文件按要求放到对应的目录下，然后在登录邮箱，并成功发送邮件后，执行：M-x elmo-passwd-alist-save方法，它即会自动将密码信息写入此文件中；
    -   下次即不再要求通过密码校验了；
-   配置签名文件
    -   可以在init-wl.el文件中找到对应的signature文件的目录，因此在对应的地方新建一个文件，然后将签名内容拷进去；
    -   则可以在发送邮件时自动生成对应的签名在后面；
-   配置邮件附件打开方式
    -   参照~/.emacs.d/user/kevin/mailcap文件，配置当前操作系统下的用来查看附件文件的方式；
    -   如下例子：
        
            application/pdf; okular  %s
            application/msword; catdoc %s
            application/octet-stream; et  %s
            application/octet-stream; wpp  %s
            application/octet-stream; wps  %s
            application/*; xdg-open  %s
            image/*; ristretto %s
            text/html; chromium %s
            text/*; emacsclient -c %s
            video/*; xdg-open %s
            audio/*; xdg-open %s
            application/x-rar; xarchiver %s
            application/x-zip; xarchiver %s
            application/x-tar; xarchiver %s

## Eshell<a id="sec-2-5" name="sec-2-5"></a>

**\***

## Tramp<a id="sec-2-6" name="sec-2-6"></a>

## Auctex<a id="sec-2-7" name="sec-2-7"></a>

\*\*

## Latex<a id="sec-2-8" name="sec-2-8"></a>

## Plantuml<a id="sec-2-9" name="sec-2-9"></a>

<http://www.plantuml.com/>
-   安装依赖
    在archlinux的aur中找到plantuml进行安装；
-   使用，在需要生成的图的位置代码用如何代码框起来

     #+begin_src plantuml :file some_filename.png :cmdline -r -s 0.8
    <context of ditaa source goes here>
     #+end_src

## Graphviz<a id="sec-2-10" name="sec-2-10"></a>

<http://www.graphviz.org/>
-   安装依赖

    sudo pacman -S graphviz

-   使用，在需要生成的图的位置代码用如何代码框起来

    #+begin_src dot :file some_filename.png :cmdline -Kdot -Tpng
       <context of graphviz source goes here>
    #+end_src

## Diaat<a id="sec-2-11" name="sec-2-11"></a>

-   安装依赖

    sudo pacman -S ditaa

-   使用，在需要生成的图的位置代码用如何代码框起来

     #+begin_src ditaa :file some_filename.png :cmdline -r -s 0.8
    <context of ditaa source goes here>
     #+end_src

## TernJs<a id="sec-2-12" name="sec-2-12"></a>

## Sunrise Commander<a id="sec-2-13" name="sec-2-13"></a>

-   说明
    Sunrise是一款类似于dired的命令行的文件管理器，具有大量命令行操作工具；
-   使用方法：显示当前及其子文件夹下所有文件
    press C-c C-f and type:  -not -type d

## GNUS with Offlineimap and mu4e and msmtp<a id="sec-2-14" name="sec-2-14"></a>

### Offlineimap<a id="sec-2-14-1" name="sec-2-14-1"></a>

1.  安装

        sudo pacman -Ss offlineimap

2.  配置

    Linux 配置
    
        [general]
        ui = TTYUI
        accounts = TRS
