emacs-document.md
        pythonfile = ~/.mutt/source/offlineimap.py
        fsync = False
        
        [Account TRS]
        localrepository = TRS-Local
        remoterepository = TRS-Remote
        status_backend = sqlite
        postsynchook = notmuch new
        # Minutes between syncs
        autorefresh = 5
        # Number of quick-syncs between autorefreshes. Quick-syncs do not update if the
        # only changes were to IMAP flags
        quick = 10
        
        [Repository TRS-Local]
        type = Maildir
        localfolders = ~/.mutt/mails/lu.jianmei/
        nametrans = lambda foldername: foldername.decode('imap4-utf-7').encode('utf-8')
        #nametrans = lambda folder : {'drafts':   '草稿箱',
        #                            'inbox':     'Inbox',
        #                            'sent':     '已发送',
        ##                            'flagged':  '[TRS]/Starred',
        #                            'trs':  'trs',
        #                            'haier':  'haier',
        #                            'pm':  'pm',
        ##                            'trash':    '[TRS]/Bin',
        #                            'archive':  'All Mail',
        ##                           }.get(folder.decode('imap4-utf-7').encode('utf-8'), folder.decode('imap4-utf-7').encode('utf-8'))
        #                           }.get(folder.decode('imap4-utf-7').encode('utf-8'), folder.decode('imap4-utf-7').encode('utf-8'))
        
        [Repository TRS-Remote]
        sslcacertfile=/etc/ssl/certs/ca-certificates.crt
        maxconnections = 2
        type = IMAP
        auth = on
        ssl = yes
        #reference = Mail
        remotehost = imap.qiye.163.com
        remoteuser = lu.jianmei@trs.com.cn
        remoteport = 993
        
        remotepasseval = get_gpg_pass(keyfile="/home/kevin/.mutt/.my-pwds.gpg")
        realdelete = no
        startdate = 2015-04-01
        # solve foldername encoding, for supporting chinese foldername in remote server
        # foldername: foldername.decode('imap4-utf-7').encode('utf-8')
        #nametrans = lambda folder: foldername.decode('imap4-utf-7').encode('utf-8') : {'Drafts':     'drafts',
        nametrans = lambda folder: folder.decode('imap4-utf-7').encode('utf-8')
        
        #folderfilter = lambda folder: folder not in ['/Bin', '/Spam','[TRS]/akamai','[TRS]/errors','[TRS]/me','[TRS]/nagios']
        folderfilter = lambda folder: folder in ['INBOX','已发送','草稿箱', 'trs','haier','pm']
        # Instead of closing the connection once a sync is complete, offlineimap will
        # send empty data to the server to hold the connection open. A value of 60
        # attempts to hold the connection for a minute between syncs (both quick and
        # autorefresh).This setting has no effect if autorefresh and holdconnectionopen
        # are not both set.
        keepalive = 60
        # OfflineIMAP normally closes IMAP server connections between refreshes if
        # the global option autorefresh is specified.  If you wish it to keep the
        # connection open, set this to true. This setting has no effect if autorefresh
        # is not set.
        holdconnectionopen = yes
    
    Mac配置
    
        [general]
        ui = TTYUI
        accounts = TRS
        pythonfile = ~/.mutt/source/offlineimap.py
        fsync = False
        
        [Account TRS]
        localrepository = TRS-Local
        remoterepository = TRS-Remote
        status_backend = sqlite
        #postsynchook = notmuch new
        # Minutes between syncs, use mu4e to refresh
        autorefresh = 0
        # Number of quick-syncs between autorefreshes. Quick-syncs do not update if the
        # only changes were to IMAP flags
        quick = 10
        
        [Repository TRS-Local]
        type = Maildir
        #localfolders = ~/.mutt/mails/lu.jianmei/
        localfolders = ~/Maildir/lu.jianmei/
        #nametrans = lambda foldername: foldername.decode('imap4-utf-7').encode('utf-8')
        #nametrans = lambda folder : {'drafts':   '草稿箱',
        #                            'inbox':     'Inbox',
        #                            'sent':     '已发送',
        ##                            'flagged':  '[TRS]/Starred',
        #                            'trs':  'trs',
        #                            'haier':  'haier',
        #                            'pm':  'pm',
        ##                            'trash':    '[TRS]/Bin',
        #                            'archive':  'All Mail',
        ##                           }.get(folder.decode('imap4-utf-7').encode('utf-8'), folder.decode('imap4-utf-7').encode('utf-8'))
        #                           }.get(folder.decode('imap4-utf-7').encode('utf-8'), folder.decode('imap4-utf-7').encode('utf-8'))
        
        [Repository TRS-Remote]
        #Sslcacertfile=/etc/ssl/certs/ca-certificates.crt
        sslcacertfile =  /Users/kevin/.emacs.d/ca-bundle.crt
        maxconnections = 2
        type = IMAP
        auth = on
        ssl = on
        #reference = Mail
        remotehost = imap.qiye.163.com
        remoteuser = lu.jianmei@trs.com.cn
        
        # imap protocol port: 993 for ssl, 143 for none ssl
        remoteport = 993
        
        #remotepasseval = get_gpg_pass(keyfile="/home/kevin/.mutt/.my-pwds.gpg")
        realdelete = no
        
        
        #folderfilter = lambda folder: folder not in ['/Bin', '/Spam','[TRS]/akamai','[TRS]/errors','[TRS]/me','[TRS]/nagios']
        # use offlineimap --info can know the remote folders. (following two unknow name is 已发送 and 草稿箱 and 已删除)
        folderfilter = lambda folder: folder in ['INBOX','trs','haier','pm','me','&XfJT0ZAB-','&g0l6P3ux-','Sent','&XfJSIJZk-']
        
        startdate = 2015-01-01
        # solve foldername encoding, for supporting chinese foldername in remote server
        # foldername: foldername.decode('imap4-utf-7').encode('utf-8')
        #nametrans = lambda folder: foldername.decode('imap4-utf-7').encode('utf-8') : {'Drafts':     'drafts',
        #nametrans = lambda x: 'INBOX.' + x
        nametrans = lambda folder: folder.decode('imap4-utf-7').encode('utf-8')
        ###nametrans = lambda folder : {'草稿箱':     'drafts',
        ###                            'INBOX':  'inbox',
        ###                            '已发送':  'sent',
        ####                            '[TRS]/Starred':    'flagged',
        ###                            'trs':    'trs',
        ###                            'haier':    'haier',
        ###                            'pm':    'pm',
        ####                            'Bin':        'trash',
        ###                            'All Mail':   'archive',
        ####                           }.get(folder.decode('imap4-utf-7').encode('utf-8'), folder.decode('imap4-utf-7').encode('utf-8'))
        ###                           }.get(folder, folder.decode('imap4-utf-7').encode('utf-8'))
        
        # Instead of closing the connection once a sync is complete, offlineimap will
        # send empty data to the server to hold the connection open. A value of 60
        # attempts to hold the connection for a minute between syncs (both quick and
        # autorefresh).This setting has no effect if autorefresh and holdconnectionopen
        # are not both set.
        keepalive = 60
        # OfflineIMAP normally closes IMAP server connections between refreshes if
        # the global option autorefresh is specified.  If you wish it to keep the
        # connection open, set this to true. This setting has no effect if autorefresh
        # is not set.
        holdconnectionopen = yes

3.  配置安全密码

### Mu4e<a id="sec-2-14-2" name="sec-2-14-2"></a>

mu4e基于mu开发，直接通过maildir格式文件进行读取邮件内容；因此可以通过offlineimap进行邮件下载，然后通过mu4e进行邮件读取及发送邮件即可；
官方网站：[<http://www.djcbsoftware.nl/code/mu>]

1.  安装

        yaourt -S mu
    
    mac上的安装
    
        # install email client related
        brew install gnutls
        #install email related
        brew install mu --with-emacs
        brew install offlineimap msmtp
        brew install curl --with-openssl && brew link curl —forc
        brew install html2text w3m

2.  配置

    配置直接通过emacs中的init-mu4e.el文件进行配置；
    完成mu4e的配置后，需要创建~/.authinfo文件，存储所需要的服务器用户名密码等信息；
    
        machine smtp.qiye.163.com login username password yourpassword

### msmtp<a id="sec-2-14-3" name="sec-2-14-3"></a>

msmtp工具用于发送邮件，mutt的基本配置内容可以参照<https://github.com/lujianmei/.mutt> 上的配置进行处理；

    brew install msmtp
