emacs-document.org
** TaskJuggler
   taskjuggler是一个出色的项目管理工具，可以支持通过org的todo任务清单，直接导出taskjuggler格式的文件tjp文件，然后可以在安装taskjuggler后，直接通过命令 *tj3 file.tjp* 将生成html项目清单文件；

*** 用orgmode写支持tjp的项目任务属性
    + Task_id: 在todo任务条上，执行 *C-c C-x p* 并输入 *task_id* 来定义一个任务唯一的id；
    + Depends: 执行 *C-c C-x p* 输入depends定义一个任务的前置任务；
    + Effort:  执行 *C-c C-x p* 输入effort定义一个任务的前置任务；支持小时h, 日d, 周w；
    + Allocate: 执行 *C-c C-x p* 输入allocate定义任务的执行人；
    + Start: 在任务开始的地方，需要输入项目开始时间，执行 *C-c C-x p* 输入start定义任务的执行人；注意，时间格式需要是：2012-4-2-0:00-+0800
    + 其它资源：


    如下属性也可以在orgmode中，对于任务上配置properties属性，并支持导出为最终的tjp格式的内容；
    |-----------+--------------+----------|
    | Tasks     | task_id      | 任务标识 |
    |           | start        | 开始日期 |
    |           | end          | 结束日期 |
    |           | duration     | 持续时间 |
    |           | scheduling   |          |
    |           | account      |          |
    |           | note         |          |
    |           | journalentry |          |
    |           | responsible  |          |
    |           | reference    |          |
    |           | milestone    | 里程碑   |
    |           | Effort       | 工作量   |
    |           | allocate     | 资源分配 |
    |           | depends      | 前置任务 |
    |           | ORDERED      | 任务关联 |
    |           | rate         | 费率     |
    |-----------+--------------+----------|
    | Resources | limits       | 限制     |
    |           | vacation     |          |
    |           | shift        |          |
    |           | booking      |          |
    |           | efficiency   |          |
    |           | journalentry |          |
    |           | rate         |          |
    |           |              |          |
    |-----------+--------------+----------|

*** 项目及资源标记
    为了方便生成项目及资源列表，需要在要生成的项目顶级任务上，标记上 *project* 标签，则此任务会被认为一个项目；而相应的资源， 需要在org文件中，另起一个一级子列表，标明资源列表，打上 *resources*标识，具体可参照如下例子：
#+begin_src html
     * 资源 :resource:
     ** 雷悦
     :PROPERTIES:
   :resource_id: leiyue
   :rate:     300
   :email:    "tellmemore@gmail.com"
   :Phone:    "136xxxxxxxx"
 :END:
     ** 谢莺
     :PROPERTIES:
   :resource_id: xieying
   :rate:     250
   :email:    "tellyoumore@gmail.com"
   :Phone:    "186xxxxxxxx"
 :END:
#+end_src
    其中的tag名称，可以在 *~/.emacs.d/user/kevin/settings/init-taskjuggle.el* 文件中进行修改；

*** 导出tjp文件
    在org文件上，执行 *C-c C-e J j* 导出此org文件为tjp文件，然后打开终端，执行 *tj3 file.tjp* 即可生成为项目文件；

*** 修改导出的文件格式或模板

** Rectangle

** keyboard macro

** ielm
* org-mode基本配置
** 文档结构信息配置
    Status详细配置解决说明参见：http://orgmode.org/manual/In_002dbuffer-settings.html#In_002dbuffer-settings
#+ATTR_LATEX: :float nil
#+BEGIN_SRC LISP
  #+STARTUP: overview
  #+STARTUP: hidestars
  #+STARTUP: logdone
  #+PROPERTY: Effort_ALL  0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
  #+COLUMNS: %38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM{Total}
  #+PROPERTY: Effort_ALL 0 0:10 0:20 0:30 1:00 2:00 3:00 4:00 8:00
  #+TAGS: { OFFICE(o) HOME(h) } COMPUTER(c) PROJECT(p) READING(r) PROBLEM(b)
  #+TAGS:  LUNCHTIME(l) ENGLISH(e)
  #+SEQ_TODO: TODO(t) STARTED(s) WAITING(w) APPT(a) | DONE(d) CANCELLED(c) DEFERRED(f)
#+END_SRC
** 文档Head信息配置
    Head详细的配置解释说明参见：http://orgmode.org/manual/Export-settings.html
#+ATTR_LATEX: :float nil
#+BEGIN_SRC LISP
    #+TITLE: Zhoushan Dangan Project Schedule
    #+LANGUAGE:  zh
    #+AUTHOR: Lu Jianmei
    #+EMAIL: lu.jianmei@trs.com.cn
    #+OPTIONS:   H:3 num:t   toc:3 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t p:t pri:t
    #+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
    #+OPTIONS:   author:t creator:t timestamp:t email:t
    #+DESCRIPTION: A notes that include all works and study things in 2015
    #+KEYWORDS:  org-mode Emacs jquery jquery.mobile jquery.ui wcm
    #+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
    #+EXPORT_SELECT_TAGS: export
    #+EXPORT_EXCLUDE_TAGS: noexport
    #+LATEX_HEADER: \usepackage{xeCJK}
    #+LATEX_HEADER: \setCJKmainfont{SimSun}
    #+LATEX_CLASS: cn-article
    #+STARTUP: logredeadline, logreschedule
    #+ATTR_HTML: :border 2 :rules all :frame all
#+END_SRC
    如果配置项目管理，可以按添加如下配置
#+BEGIN_SRC LISP
    #+COLUMNS: #+COLUMNS: %25ITEM %DEADLINE %SCHEDULED %11Status %9Approved(Approved?){X} %TAGS %PRIORITY %TODO
    #+Status_ALL: "In progress" "Not started yet" "Finished" ""
    #+Approved_ALL: "[ ]" "[X]"
#+END_SRC

** 表格与图片配置
    表格导出与图片导出成latex时，需要设置相应的导出latex参数，具体参数参见：http://orgmode.org/org.html#LaTeX-specific-attributes
#+ATTR_LATEX: :float nil
#+BEGIN_SRC LISP
     #+ATTR_LATEX: :environment longtable :align l|lp{3cm}r|l
     #+ATTR_LATEX: :mode math :environment bmatrix :math-suffix \times
#+END_SRC
#+ATTR_LATEX: :float nil
#+BEGIN_SRC LISP
     ;;图片
     #+ATTR_LATEX: :width 5cm :options angle=90
     [[./img/sed-hr4049.pdf]]
     #+ATTR_LATEX: :caption \bicaption{HeadingA}{HeadingB}
     [[./img/sed-hr4049.pdf]]
#+END_SRC
* 快捷键
