emacs-document.org
** Projectile & helm
Project address: https://github.com/bbatsov/projectile
#+CAPTION: 绑定helm后的快捷键
#+ATTR_LATEX: :environment :align l{2cm}|lp{2cm}r|lp{2cm}r|l{2cm}|l
| 分类     | 快捷键        | 描述                                                               | 掌握重点 |                                        |
|----------+---------------+--------------------------------------------------------------------+----------+----------------------------------------|
| 基本查找 | C-c p h/C-c h | 打开helm-projectile，查看当前管理的所有项目及文件的全局搜索        | 常用     |                                        |
|          | C-c p d       | 查找项目中的文件夹                                                 | 常用     | 需要在helm项目视图下执行               |
|          | C-c p e       | 打开近期打开的文件                                                 | 常用     |                                        |
|          | C-c p a       | 打开当前名称相同的另一个后缀不相同的文件（js/css名称相同时用）     | 常用     |                                        |
|          | C-c p i       | 刷新项目文件缓存                                                   | 有时     |                                        |
|          | C-c p z       | 将当前文件添加到项目中                                             |          |                                        |
|----------+---------------+--------------------------------------------------------------------+----------+----------------------------------------|
| 项目管理 | C-c p p       | 当配置helm直接接管projectile后，可以直接用projectile项目切换快捷键 | 常用     | 以下命令是在项目视图下执行对应的Action |
|          | C-d           | 使用Dired打开项目地址目录                                          | 常用     | 需要在helm项目视图下执行               |
|          | M-g           | 打开项目root目录                                                   | 常用     | 需要在helm项目视图下执行               |
|          | M-e           | 在项目中打开Eshell                                                 |          | 需要在helm项目视图下执行               |
|          | C-s           | 使用grep命令                                                       |          | 需要在helm项目视图下执行               |
|          | C-u C-s       | 使用grep进行递归查找                                               |          | 需要在helm项目视图下执行               |
|          | C-c           | 执行编译命令（可配置）                                             |          | 需要在helm项目视图下执行               |
|          | M-D           | 删除项目                                                           |          |                                        |
|----------+---------------+--------------------------------------------------------------------+----------+----------------------------------------|
| 文件管理 | C-c p f       | 在项目中查找文件                                                   | 常用     |                                        |
|          | M-SPC         | 标记当前文件                                                       |          |                                        |
|          | M-a           | 标记所有文件                                                       |          |                                        |
|          | C-c o         | 在新窗口中打开文件                                                 |          |                                        |
|          | C-c C-o       | 用新frame打开文件                                                        |          |                                        |
|          | C-c C-x       | 使用外部程序打开文件                                                         |          |                                        |
|          | C-c r         | 用root打开文件                                                     |          |                                        |
|          | M-R           | 对文件进行重命名，通过M-SPC选择文件，通过M-R对文件进行重命名或移动操作 |          |                                        |
|          | M-C           | 拷贝文件                                                           |          |                                        |
|          | M-D           | 删除文件                                                           |          |                                        |
|          | C-c p g       | 重新匹配输入的命令，用于在未发现文件时的操作                       |          |                                        |
|----------+---------------+--------------------------------------------------------------------+----------+----------------------------------------|
| 缓冲管理 | C-c p b       | 在项目中切换buffer                                                 |          |                                        |
|----------+---------------+--------------------------------------------------------------------+----------+----------------------------------------|
| 项目搜索 | C-c p s g     | 项目中搜索内容                                                     | 常用     |                                        |
|          | C-c p s a     | 使用ack搜索内容                                                    |          |                                        |
|          | C-c p s s     | 使用ag搜索内容                                                     |          |                                        |
|----------+---------------+--------------------------------------------------------------------+----------+----------------------------------------|
| 项目管理 |               |                                                                    |          |                                        |

** Projectile
#+CAPTION: Projectile快捷键收集
     #+ATTR_LATEX: :environment longtable :align l|l|l
| 快捷键        | 描述                                                                                                       |
| C-c p f       | Display a list of all files in the project. With a prefix argument it will clear the cache first.          |
| C-c p F       | Display a list of all files in all known projects.                                                         |
| C-c p g       | Display a list of all files at point in the project. With a prefix argument it will clear the cache first. |
| C-c p 4 f     | Jump to a project's file using completion and show it in another window.                                   |
| C-c p 4 g     | Jump to a project's file based on context at point and show it in another window.                          |
| C-c p d       | Display a list of all directories in the project. With a prefix argument it will clear the cache first.    |
| C-c p 4 d     | Switch to a project directory and show it in another window.                                               |
| C-c p 4 a     | Switch between files with the same name but different extensions in other window.                          |
| C-c p T       | Display a list of all test files(specs, features, etc) in the project.                                     |
| C-c p l       | Display a list of all files in a directory (that's not necessarily a project)                              |
| C-c p s g     | Run grep on the files in the project.                                                                      |
| M-- C-c p s g | Run grep on projectile-grep-default-files in the project.                                                  |
| C-c p v       | Run vc-dir on the root directory of the project.                                                           |
| C-c p b       | Display a list of all project buffers currently open.                                                      |
| C-c p 4 b     | Switch to a project buffer and show it in another window.                                                  |
| C-c p 4 C-o   | Display a project buffer in another window without selecting it.                                           |
| C-c p a       | Switch between files with the same name but different extensions.                                          |
| C-c p o       | Runs multi-occur on all project buffers currently open.                                                    |
| C-c p r       | Runs interactive query-replace on all files in the projects.                                               |
| C-c p i       | Invalidates the project cache (if existing).                                                               |
| C-c p R       | Regenerates the projects TAGS file.                                                                        |
| C-c p j       | Find tag in project's TAGS file.                                                                           |
| C-c p k       | Kills all project buffers.                                                                                 |
| C-c p D       | Opens the root of the project in dired.                                                                    |
| C-c p e       | Shows a list of recently visited project files.                                                            |
| C-c p s s     | Runs ag on the project. Requires the presence of ag.el.                                                    |
| C-c p !       | Runs shell-command in the root directory of the project.                                                   |
| C-c p &       | Runs async-shell-command in the root directory of the project.                                             |
| C-c p c       | Runs a standard compilation command for your type of project.                                              |
| C-c p P       | Runs a standard test command for your type of project.                                                     |
| C-c p t       | Toggle between an implementation file and its test file.                                                   |
| C-c p 4 t     | Jump to implementation or test file in other window.                                                       |
| C-c p z       | Adds the currently visited file to the cache.                                                              |
| C-c p p       | Display a list of known projects you can switch to.                                                        |
| C-c p S       | Save all project buffers.                                                                                  |
| C-c p m       | Run the commander (an interface to run commands with a single key).                                        |
| C-c p ESC     | Switch to the most recently selected projectile buffer.                                                    |

