emacs-document.md

## Projectile & helm<a id="sec-4-7" name="sec-4-7"></a>

Project address: <https://github.com/bbatsov/projectile>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 4:</span> 绑定helm后的快捷键</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">分类</th>
<th scope="col" class="left">快捷键</th>
<th scope="col" class="left">描述</th>
<th scope="col" class="left">掌握重点</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>

<tbody>
<tr>
<td class="left">基本查找</td>
<td class="left">C-c p h/C-c h</td>
<td class="left">打开helm-projectile，查看当前管理的所有项目及文件的全局搜索</td>
<td class="left">常用</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c p d</td>
<td class="left">查找项目中的文件夹</td>
<td class="left">常用</td>
<td class="left">需要在helm项目视图下执行</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c p e</td>
<td class="left">打开近期打开的文件</td>
<td class="left">常用</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c p a</td>
<td class="left">打开当前名称相同的另一个后缀不相同的文件（js/css名称相同时用）</td>
<td class="left">常用</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c p i</td>
<td class="left">刷新项目文件缓存</td>
<td class="left">有时</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c p z</td>
<td class="left">将当前文件添加到项目中</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="left">项目管理</td>
<td class="left">C-c p p</td>
<td class="left">当配置helm直接接管projectile后，可以直接用projectile项目切换快捷键</td>
<td class="left">常用</td>
<td class="left">以下命令是在项目视图下执行对应的Action</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-d</td>
<td class="left">使用Dired打开项目地址目录</td>
<td class="left">常用</td>
<td class="left">需要在helm项目视图下执行</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">M-g</td>
<td class="left">打开项目root目录</td>
<td class="left">常用</td>
<td class="left">需要在helm项目视图下执行</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">M-e</td>
<td class="left">在项目中打开Eshell</td>
<td class="left">&#xa0;</td>
<td class="left">需要在helm项目视图下执行</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-s</td>
<td class="left">使用grep命令</td>
<td class="left">&#xa0;</td>
<td class="left">需要在helm项目视图下执行</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-u C-s</td>
<td class="left">使用grep进行递归查找</td>
<td class="left">&#xa0;</td>
<td class="left">需要在helm项目视图下执行</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c</td>
<td class="left">执行编译命令（可配置）</td>
<td class="left">&#xa0;</td>
<td class="left">需要在helm项目视图下执行</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">M-D</td>
<td class="left">删除项目</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="left">文件管理</td>
<td class="left">C-c p f</td>
<td class="left">在项目中查找文件</td>
<td class="left">常用</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">M-SPC</td>
<td class="left">标记当前文件</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">M-a</td>
<td class="left">标记所有文件</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c o</td>
<td class="left">在新窗口中打开文件</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c C-o</td>
<td class="left">用新frame打开文件</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c C-x</td>
<td class="left">使用外部程序打开文件</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c r</td>
<td class="left">用root打开文件</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">M-R</td>
<td class="left">对文件进行重命名，通过M-SPC选择文件，通过M-R对文件进行重命名或移动操作</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">M-C</td>
<td class="left">拷贝文件</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">M-D</td>
<td class="left">删除文件</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c p g</td>
<td class="left">重新匹配输入的命令，用于在未发现文件时的操作</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="left">缓冲管理</td>
<td class="left">C-c p b</td>
<td class="left">在项目中切换buffer</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="left">项目搜索</td>
<td class="left">C-c p s g</td>
<td class="left">项目中搜索内容</td>
<td class="left">常用</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c p s a</td>
<td class="left">使用ack搜索内容</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c p s s</td>
<td class="left">使用ag搜索内容</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="left">项目管理</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
